export enum SexualOrientation {
  HOMO = 'Гомосексуальная (вас привлекают преимущественно люди вашего гендера романтически и/или сексуально)',
  BI = 'Бисексуальная / Пансексуальная (вас привлекают романтически и/или сексуально люди более чем одного гендера)',
  HETERO = 'Гетеросексуальная (вас привлекают романтически и/или сексуально мужчины, если вы женщина, и женщины, если вы мужчина)',
  ASEX = 'Асексуальная (вас вообще не привлекают люди ни сексуально, ни романтически)',
  OTHER = 'Другое',
}

export enum Gender {
  MALE = 'Мужчина',
  FEMALE = 'Женщина',
  NON_BINAIRY = 'Небинарный человек',
}

export enum SettlementType {
  MEGAPOLIS = 'Мегаполис (более 3 млн., Москва или Петербург)',
  CITY = 'Крупный город (от 1 млн. до 3 млн.)',
  LARGE_TOWN = 'Город (от 500 тыс. до 1 млн.)',
  MEDIUM_TOWN = 'Город (от 100 до 500 тыс.)',
  SMALL_TOWN = 'Малый город (до 100 тыс.)',
  SELO = 'Сельское поселение',
  OTHER = 'Другое',
}
